package hw03;

import java.util.Scanner;

/**
 * Создать программу, выводящую на экран ближайшее к 10 из двух чисел, введенных с консоли.
 * Например, среди чисел 8,5 и 11,45 ближайшее к десяти 11,45.
 */
public class Task2 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите первое число : ");
        int number1 = sc.nextInt();
        System.out.println("Введите второе число : ");
        int number2 = sc.nextInt();

    }
}
